Catalogs/Сертификаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Сертификаты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСертификата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСертификатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСертификата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоминалПогашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрационныеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.Сертификаты</v8:Type>
						<v8:Type>cfg:DocumentRef.НакладнаяНаДоставку</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Сертификаты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Функция ПолучитьНаименование()

	////Костенюк Александр-Закомментировано 14.01.2015
	//Если ЗначениеЗаполнено(Объект.ВидСертификата) И (Не ПустаяСтрока(Объект.КодСертификата)) Тогда
	//	Возврат Шаблон("[ВидСертификата] № [КодСертификата]", 
	//	Новый Структура("ВидСертификата,КодСертификата", Объект.ВидСертификата, Объект.КодСертификата));
	//КонецЕсли;
	////Костенюк Александр-Закомментировано 14.01.2015
	
	Возврат "№" + Объект.КодСертификата; 
		
КонецФункции // ПолучитьНаименование()

&НаСервере
Функция ПолучитьНаименованиеНаСервере()

	Если ЗначениеЗаполнено(Объект.ВидСертификата) И (Не ПустаяСтрока(Объект.КодСертификата)) Тогда
		Возврат Шаблон("[ВидСертификата] № [КодСертификата]", 
			Новый Структура("ВидСертификата,КодСертификата", Объект.ВидСертификата, Объект.КодСертификата));
	КонецЕсли; 
	
	Возврат "№ " + Объект.КодСертификата; 
		
КонецФункции // ПолучитьНаименованиеНаСервере()


&НаКлиенте
Процедура КодСертификатаПриИзменении(Элемент)
	
	// Автоматическое формирование наименования.
	__РаботаСДиалогамиКлиентСервер.ФормаНаименованиеАвтоматическоеФормированиеСформировать(ФормироватьНаименованиеАвтоматически, Объект.Наименование, ПолучитьНаименование(), Элементы.Наименование);
	
КонецПроцедуры // КодСертификатаПриИзменении()

&НаКлиенте
Процедура ВидСертификатаПриИзменении(Элемент)
	
	// Автоматическое формирование наименования.
	__РаботаСДиалогамиКлиентСервер.ФормаНаименованиеАвтоматическоеФормированиеСформировать(ФормироватьНаименованиеАвтоматически, Объект.Наименование, ПолучитьНаименование(), Элементы.Наименование);
	
	// Настройка формы.
	ВидСертификатаПриИзмененииСервер();
	
КонецПроцедуры // ВидСертификатаПриИзменении()

&НаСервере
Процедура ВидСертификатаПриИзмененииСервер()
	
	Элементы.ВидСертификата.ТолькоПросмотр = Объект.Ссылка.ВидСертификата.OnLine;
	Элементы.КодСертификата.ТолькоПросмотр = Элементы.ВидСертификата.ТолькоПросмотр;
	Элементы.Сумма.ТолькоПросмотр = Элементы.ВидСертификата.ТолькоПросмотр;
	Элементы.ДекорацияИзменитьАктуальность.Видимость = (Не Элементы.ВидСертификата.ТолькоПросмотр);
	Элементы.ТипШтрихкода.ТолькоПросмотр = Элементы.ВидСертификата.Доступность;
	Элементы.Штрихкод.ТолькоПросмотр = Элементы.ВидСертификата.ТолькоПросмотр;
	
	Элементы.ДисконтнаяКарта.Доступность = (Не Элементы.ВидСертификата.ТолькоПросмотр) И Объект.ВидСертификата.НеобходимаДисконтнаяКатрочка;
	Элементы.Пароль.Доступность = (Не Элементы.ВидСертификата.ТолькоПросмотр) И Объект.ВидСертификата.НеобходимПароль;
	
	Элементы.ДисконтнаяКарта.АвтоОтметкаНезаполненного = Элементы.ДисконтнаяКарта.Доступность;
	Элементы.Пароль.АвтоОтметкаНезаполненного = Элементы.Пароль.Доступность;
	
	Объект.НоминалПогашения = Объект.ВидСертификата.НоминалПогашения; //Костенюк Александр 12.12.2014

КонецПроцедуры // ВидСертификатаПриИзменении()

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	// Автоматическое формирование наименования.
	__РаботаСДиалогамиКлиентСервер.ФормаНаименованиеАвтоматическоеФормированиеУстановитьПризнак(ФормироватьНаименованиеАвтоматически, Объект.Наименование, ПолучитьНаименование(), Элементы.Наименование);
	
КонецПроцедуры // НаименованиеПриИзменении()

&НаКлиенте
Процедура ДекорацияИзменитьАктуальностьНажатие(Элемент)

	// Настройка формы.
	ДекорацияИзменитьАктуальностьНажатиеСервер();
	
КонецПроцедуры // ДекорацияИзменитьАктуальностьНажатие()

&НаСервере
Процедура ДекорацияИзменитьАктуальностьНажатиеСервер()
	
	// Настройка формы.
	Элементы.Актуальность.Видимость = Истина;
	Элементы.ДекорацияАктуальность.Видимость = Ложь;
	Элементы.ДекорацияНеАктуальность.Видимость = Ложь;
	Элементы.ДекорацияИзменитьАктуальность.Видимость = Ложь;

КонецПроцедуры // ДекорацияИзменитьАктуальностьНажатие()


&НаКлиенте
Процедура ТипШтрихкодаПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Штрихкод.ТипШтрихкода) Тогда
		Штрихкод.ТипШтрихкода = ПредопределенноеЗначение("ПланВидовХарактеристик.ТипыШтрихкодов.EAN13");
	КонецЕсли; 
	
КонецПроцедуры // ТипШтрихкодаПриИзменении()

&НаКлиенте
Процедура ШтрихкодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ШтрихкодНачалоВыбораСервер();
	
КонецПроцедуры // ШтрихкодНачалоВыбора()

&НаСервере
Процедура ШтрихкодНачалоВыбораСервер()
	
	Штрихкод.Штрихкод = РегистрыСведений.Штрихкоды.СформироватьШтрихКод(Неопределено, Штрихкод.ТипШтрихкода);
	
КонецПроцедуры // ШтрихкодНачалоВыбораСервер()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Данные.
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииНаСервере(Объект);	
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Автоматическое формирование наименования.
	__РаботаСДиалогамиКлиентСервер.ФормаНаименованиеАвтоматическоеФормированиеУстановитьПризнак(ФормироватьНаименованиеАвтоматически, Объект.Наименование, ПолучитьНаименованиеНаСервере(), Элементы.Наименование);
	
	// Штрих код.
	ЗначениеВРеквизитФормы(РегистрыСведений.Штрихкоды.ПолучитьПараметрыШтрихКода(ТекущийОбъект), "Штрихкод");
	
	// Настройка формы.
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ДекорацияИзменитьАктуальностьНажатиеСервер();
	Иначе
		Элементы.Актуальность.Видимость = Ложь;
		Элементы.ДекорацияАктуальность.Видимость = Объект.Актуальность;
		Элементы.ДекорацияНеАктуальность.Видимость = Не Объект.Актуальность;
		Элементы.ДекорацияИзменитьАктуальность.Видимость = Истина;
	КонецЕсли;
	
	ВидСертификатаПриИзмененииСервер();

КонецПроцедуры // ПриЧтенииНаСервере()

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Штрих код.
	РегистрыСведений.Штрихкоды.УстановитьШтрихКод(ТекущийОбъект, Штрихкод.ТипШтрихкода, Штрихкод.Штрихкод, Отказ);
	
КонецПроцедуры // ПриЗаписиНаСервере()
